Revit 2026 API

# InternalDefinition Properties

---

The InternalDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BuiltInParameter | Tests whether this definition identifies a built-in parameter or not. |
|  | Id | The id of the parameter. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The user-visible name for the parameter.(Overrides DefinitionName) |
|  | VariesAcrossGroups | Whether or not the parameter values can vary across group members. |
|  | Visible | Indicates if the parameter is visible in the Autodesk Revit user interface. |

#### Reference

InternalDefinition Class

Autodesk.Revit.DB Namespace